import { v4 as uuidv4 } from 'uuid';

export const vacanciesArray = [
  {
    id: uuidv4(),
    image: '/img/vacancy-bg.png',
    militaryRank: 'Оператор БПЛА',
    text: 'Універсальна машина смерті для росіян. Ми навчимо тебе стріляти зі всього, що стріляє, загартуємо твій дух і тіло.',
    learnMore: 'Дізнатися більше',
    url: '/',
  },
  {
    id: uuidv4(),
    image: '/img/vacancy-bg2.png',
    militaryRank: 'Оператор БПЛА',
    text: 'Універсальна машина смерті для росіян. Ми навчимо тебе стріляти зі всього, що стріляє, загартуємо твій дух і тіло.',
    learnMore: 'Дізнатися більше',
    url: '/',
  },
  {
    id: uuidv4(),
    image: '/img/vacancy-bg.png',
    militaryRank: 'Оператор БПЛА',
    text: 'Універсальна машина смерті для росіян. Ми навчимо тебе стріляти зі всього, що стріляє, загартуємо твій дух і тіло.',
    learnMore: 'Дізнатися більше',
    url: '/',
  },
  {
    id: uuidv4(),
    image: '/img/vacancy-bg2.png',
    militaryRank: 'Оператор БПЛА',
    text: 'Універсальна машина смерті для росіян. Ми навчимо тебе стріляти зі всього, що стріляє, загартуємо твій дух і тіло.',
    learnMore: 'Дізнатися більше',
    url: '/',
  },
];
